{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Optimistic",
    "1": "Thankful",
    "2": "Empathetic",
    "3": "Pessimistic",
    "4": "Anxious",
    "5": "Sad",
    "6": "Annoyed",
    "7": "Denial",
    "8": "Official report",
    "9": "Joking"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Annoyed": 6,
    "Anxious": 4,
    "Denial": 7,
    "Empathetic": 2,
    "Joking": 9,
    "Official report": 8,
    "Optimistic": 0,
    "Pessimistic": 3,
    "Sad": 5,
    "Thankful": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
